[
    {
        "name": "Interfraternity Council (IFC) - Risk Management Consultant",
        "year": "Fall 2021",
        "description": [
            "Encouraged Social and Risk Management Policies. Helped hosts spot policy violations and advising them on how to mitigate risk."
        ],
        "link": "https://www.mitifc.com/risk-handbook/",
        "tags": [
            "work"
        ]
    },
    {
        "name": "Twitter SWE",
        "year": "June 2021 - Present",
        "description": [
            "Introduced Zipkin tracing to sample live SQL operations and save them for access in BigQuery",
            "Developed scheduled job that finds how often each graph/partition are hit and the popular queries under each",
            "Built dashboard for engineers to identify pain points and trends in partition/graph load"
        ],
        "icon": "twitter.jpg",
        "tags": [
            "work"
        ]
    },
    {
        "name": "SuperUROP - Responsible Regulating Social Media",
        "year": "May 2020 - May 2021",
        "description": [
            "Developed a policy that can test and quantify the effect of content curation on user learning",
            "Built a recommendation system using content filtering and matrix factorization algorithms",
            "Created learning agents to track the effect of different recommending systems on decision making",
            "Abstract: Social Media Platforms (SMPs) use recommendations to provide userswith content [1].  Some standard recommendation techniques can nega-tively affect the way users learn and how much SMPs can profit.  Plat-forms can to have a greedy approach when recommending content to users,which can negatively affect learning and profits.  We align the platform’sgoals with gaining more money and user’s goals to learn freely by modify-ing how recommendation systems estimate and recommend to their users.We introduce a new approach for estimating user interests for topics tointroduce diversity and treat users as a learning agent rather than a staticuser.  We found a way that a SMP can focus on these goals to improveusers’ learning experiences and make more profit than current approaches"
        ],
        "pdf": {
            "name": "Responsible Regulating Social Media PDF",
            "link": "https://drive.google.com/file/d/15iwvnPyylNGwLkDqHr37FQsH4W7KADlL/view?usp=sharing"
        },
        "icon": "lids.jpg",
        "tags": [
            "work",
            "research"
        ]
    },
    {
        "name": "Facebook SWE ",
        "year": "June 2020 - August 2020",
        "description": [
            "Created internal tool to load B2C chat plugin for debugging and E2E + snapshot testing",
            "Refactored existing web controller to use class-based evaluator for whitelisting and privacy rules",
            "Updated the on boarding flow for the chat plugin to allow businesses to add and customize newly introduced features"
        ],
        "icon": "facebook.png",
        "tags": [
            "work"
        ]
    },
    {
        "name": "Interfraternity Council (IFC) - Risk Management Consultant",
        "year": "Spring 2020",
        "description": [
            "Encouraged Social and Risk Management Policies. Helped hosts spot policy violations and advising them on how to mitigate risk."
        ],
        "link": "https://www.mitifc.com/risk-handbook/",
        "tags": [
            "work"
        ]
    },
    {
        "name": "TownSq SWE",
        "year": "January 2020",
        "description": [
            "Constructed front end dashboard displaying average feedback, reviews, and payment churn for HOA managers toimprove resident experiences",
            "Participated in Data Lab with AWS to develop data lake + warehouse for HOA resident feedback and payment metrics"
        ],
        "link": "https://townsq.io/",
        "tags": [
            "work"
        ]
    },
    {
        "name": "HKN Algorithms Tutor",
        "year": "January 2019 - January 2020",
        "description": [
            "Mentored and taught 2 students each semester in Introduction to Algorithms and Data Structures 6.006. Topics included Master Theorem, Insertion + Selection + Merge + In Place Merge + Radix Sort, dynamic arrays, BSTs, AVLs, Heaps, Hash Maps, BFS, DFS, Dijkstras, Johnsons, Bellman Ford, Dynamic Programming, Subset Sum & Pseudo-polynomial, P, NP, Hardness, Completeness"
        ],
        "tags": [
            "work"
        ]
    },
    {
        "name": "Facebook University SWE",
        "year": "June 2019 - August 2019",
        "description": [
            "Developed an Android application called Skillshop that allows users to post workshops they want to teach and theability to sign up for public workshops connecting them to teachers and other students in the class"
        ],
        "icon": "facebook.png",
        "tags": [
            "work"
        ]
    },
    {
        "name": "Global Teching Labs - Teaching Assistant",
        "year": "January 2019",
        "description": [
            "Taught intro computer science to highschool sophomores and mentored mobile app development to highschool juniors at Prepa Tec in Mexico City"
        ],
        "link": "https://misti.mit.edu/your-resources/crafting-your-experience/types-programs/global-teaching-labs",
        "tags": [
            "work"
        ]
    },
    {
        "name": "Whataburger",
        "year": "Spring 2018",
        "description": [
            "Exceptional drive-thru personel 🍔. I always gave extra spicy ketchup."
        ],
        "icon": "whataburger.png",
        "tags": [
            "work"
        ]
    }
]